Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
eway_method.runs-filtering_terms: Refreshing state... [id=agm-ie44xht6ej-mth0ua-GET]
module.sbeacon.aws_api_gateway_method.root-get: Refreshing state... [id=agm-ie44xht6ej-cvdi0juudf-GET]
module.sbeacon.aws_api_gateway_method.datasets-id-biosamples_post: Refreshing state... [id=agm-ie44xht6ej-opnk88-POST]
module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post: Refreshing state... [id=agm-ie44xht6ej-3oibyp-POST]
module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples_post: Refreshing state... [id=agm-ie44xht6ej-l4ys82-POST]
module.sbeacon.aws_api_gateway_method.g_variants-id-individuals: Refreshing state... [id=agm-ie44xht6ej-8aa2iw-GET]
module.sbeacon.aws_api_gateway_method.biosamples-id-analyses_post: Refreshing state... [id=agm-ie44xht6ej-2390s8-POST]
module.sbeacon.aws_api_gateway_method.analyses_post: Refreshing state... [id=agm-ie44xht6ej-ctcjbz-POST]
module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post: Refreshing state... [id=agm-ie44xht6ej-mth0ua-POST]
module.sbeacon.aws_api_gateway_method.individuals: Refreshing state... [id=agm-ie44xht6ej-8vgzor-GET]
module.sbeacon.aws_api_gateway_method.analyses: Refreshing state... [id=agm-ie44xht6ej-ctcjbz-GET]
module.cognito.aws_iam_role.gaspi_authenticated: Refreshing state... [id=gaspi_authenticated]
module.cognito.aws_iam_role.gaspi_unauthenticated: Refreshing state... [id=gaspi_unauthenticated]
module.cognito.aws_iam_role.admin_group_role: Refreshing state... [id=gaspi-admin-group-role]
module.cognito.aws_iam_role.manager_group_role: Refreshing state... [id=gaspi-manager-group-role]
module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms_post: Refreshing state... [id=agmr-ie44xht6ej-zugz2o-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants: Refreshing state... [id=agmr-ie44xht6ej-u3j0s3-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants: Refreshing state... [id=agmr-ie44xht6ej-jbisxi-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs_post: Refreshing state... [id=agmr-ie44xht6ej-644tan-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets: Refreshing state... [id=agmr-ie44xht6ej-0uetuv-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets_post: Refreshing state... [id=agmr-ie44xht6ej-0uetuv-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms: Refreshing state... [id=agmr-ie44xht6ej-mp4ybi-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples: Refreshing state... [id=agmr-ie44xht6ej-oyrzyr-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples_post: Refreshing state... [id=agmr-ie44xht6ej-kmbmk2-POST-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ie44xht6ej-r7891j-OPTIONS-200]
module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-admin:sbeacon-backend-admin-0]
module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post: Refreshing state... [id=agmr-ie44xht6ej-mp4ybi-POST-200]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ie44xht6ej-8aa2iw-OPTIONS-200]
module.sbeacon.aws_api_gateway_method_response.g_variants_post: Refreshing state... [id=agmr-ie44xht6ej-u3j0s3-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples: Refreshing state... [id=agmr-ie44xht6ej-l4ys82-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples: Refreshing state... [id=agmr-ie44xht6ej-opnk88-GET-200]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ie44xht6ej-7u2paa-OPTIONS-200]
module.sbeacon.module.cors-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ie44xht6ej-8vgzor-OPTIONS-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id: Refreshing state... [id=agmr-ie44xht6ej-w9v6rx-GET-200]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ie44xht6ej-f9bnos-OPTIONS-200]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-ie44xht6ej-f9bnos-OPTIONS]
module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants: Refreshing state... [id=agmr-ie44xht6ej-0od49b-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post: Refreshing state... [id=agmr-ie44xht6ej-8aa2iw-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs-id: Refreshing state... [id=agmr-ie44xht6ej-qoymxe-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post: Refreshing state... [id=agmr-ie44xht6ej-jbisxi-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants: Refreshing state... [id=agmr-ie44xht6ej-r7891j-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post: Refreshing state... [id=agmr-ie44xht6ej-f9bnos-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants_post: Refreshing state... [id=agmr-ie44xht6ej-r7891j-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs: Refreshing state... [id=agmr-ie44xht6ej-644tan-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants: Refreshing state... [id=agmr-ie44xht6ej-vud1nd-GET-200]
module.sbeacon.aws_api_gateway_method_response.info: Refreshing state... [id=agmr-ie44xht6ej-571p64-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post: Refreshing state... [id=agmr-ie44xht6ej-bvsqdc-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals: Refreshing state... [id=agmr-ie44xht6ej-bvsqdc-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post: Refreshing state... [id=agmr-ie44xht6ej-6or2bd-POST-200]
module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms: Refreshing state... [id=agmr-ie44xht6ej-f9bnos-GET-200]
module.sbeacon.aws_api_gateway_method_response.entry_types: Refreshing state... [id=agmr-ie44xht6ej-f56oez-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post: Refreshing state... [id=agmr-ie44xht6ej-vud1nd-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id_post: Refreshing state... [id=agmr-ie44xht6ej-v43f7d-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples: Refreshing state... [id=agmr-ie44xht6ej-kmbmk2-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs: Refreshing state... [id=agmr-ie44xht6ej-7u2paa-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms: Refreshing state... [id=agmr-ie44xht6ej-zugz2o-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id: Refreshing state... [id=agmr-ie44xht6ej-xp4kaq-GET-200]
module.sbeacon.aws_api_gateway_method_response.filtering_terms: Refreshing state... [id=agmr-ie44xht6ej-fxz20h-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses: Refreshing state... [id=agmr-ie44xht6ej-kd288s-GET-200]
module.sbeacon.aws_api_gateway_method_response.analyses-id_post: Refreshing state... [id=agmr-ie44xht6ej-w9v6rx-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses: Refreshing state... [id=agmr-ie44xht6ej-2390s8-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms: Refreshing state... [id=agmr-ie44xht6ej-6or2bd-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id: Refreshing state... [id=agmr-ie44xht6ej-su0dln-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals_post: Refreshing state... [id=agmr-ie44xht6ej-8vgzor-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs_post: Refreshing state... [id=agmr-ie44xht6ej-7u2paa-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms_post: Refreshing state... [id=agmr-ie44xht6ej-ejinz3-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms: Refreshing state... [id=agmr-ie44xht6ej-ejinz3-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id_post: Refreshing state... [id=agmr-ie44xht6ej-su0dln-POST-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post: Refreshing state... [id=agmr-ie44xht6ej-oyrzyr-POST-200]
module.sbeacon.aws_api_gateway_method_response.configuration: Refreshing state... [id=agmr-ie44xht6ej-rr4wq8-GET-200]
module.sbeacon.aws_api_gateway_method_response.individuals-id_post: Refreshing state... [id=agmr-ie44xht6ej-xp4kaq-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants: Refreshing state... [id=agmr-ie44xht6ej-3oibyp-GET-200]
module.sbeacon.aws_api_gateway_method_response.runs-id_post: Refreshing state... [id=agmr-ie44xht6ej-qoymxe-POST-200]
module.sbeacon.aws_api_gateway_method_response.admin_proxy: Refreshing state... [id=agmr-ie44xht6ej-uol7gv-ANY-200]
module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms: Refreshing state... [id=agmr-ie44xht6ej-mth0ua-GET-200]
module.sbeacon.aws_api_gateway_method_response.root-get: Refreshing state... [id=agmr-ie44xht6ej-cvdi0juudf-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples_post: Refreshing state... [id=agmr-ie44xht6ej-opnk88-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post: Refreshing state... [id=agmr-ie44xht6ej-l4ys82-POST-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id_post: Refreshing state... [id=agmr-ie44xht6ej-omr0r2-POST-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses_post: Refreshing state... [id=agmr-ie44xht6ej-2390s8-POST-200]
module.sbeacon.aws_api_gateway_method_response.analyses_post: Refreshing state... [id=agmr-ie44xht6ej-ctcjbz-POST-200]
module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post: Refreshing state... [id=agmr-ie44xht6ej-mth0ua-POST-200]
module.sbeacon.aws_api_gateway_method_response.dportal_proxy: Refreshing state... [id=agmr-ie44xht6ej-4ebvbs-ANY-200]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-1]
module.sbeacon.aws_api_gateway_method_response.analyses: Refreshing state... [id=agmr-ie44xht6ej-ctcjbz-GET-200]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-0]
module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-2]
module.sbeacon.aws_api_gateway_method_response.biosamples-id: Refreshing state... [id=agmr-ie44xht6ej-v43f7d-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals: Refreshing state... [id=agmr-ie44xht6ej-8aa2iw-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants_post: Refreshing state... [id=agmr-ie44xht6ej-3oibyp-POST-200]
module.cognito.aws_iam_role_policy.gaspi_authenticated: Refreshing state... [id=gaspi_authenticated:authenticated_policy]
module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles: Refreshing state... [id=ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9]
module.cognito.aws_iam_role_policy.gaspi_unauthenticated: Refreshing state... [id=gaspi_unauthenticated:unauthenticated_policy]
module.cognito.aws_cognito_user_group.admin_group: Refreshing state... [id=ap-southeast-3_1pggQ2ofX/administrators]
module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment: Refreshing state... [id=gaspi-admin-group-role-20241204061052309600000001]
module.sbeacon.aws_api_gateway_method_response.individuals: Refreshing state... [id=agmr-ie44xht6ej-8vgzor-GET-200]
module.cognito.aws_cognito_user_group.manager_group: Refreshing state... [id=ap-southeast-3_1pggQ2ofX/managers]
module.cognito.aws_iam_role_policy_attachment.manager_group_role_policy_attachment: Refreshing state... [id=gaspi-manager-group-role-20241218041541303900000001]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ie44xht6ej-f9bnos-OPTIONS-200]
module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post: Refreshing state... [id=agmr-ie44xht6ej-kd288s-POST-200]
module.sbeacon.aws_api_gateway_method_response.map: Refreshing state... [id=agmr-ie44xht6ej-d6vqj2-GET-200]
module.sbeacon.aws_api_gateway_method_response.g_variants-id: Refreshing state... [id=agmr-ie44xht6ej-omr0r2-GET-200]
module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post: Refreshing state... [id=agmr-ie44xht6ej-0od49b-POST-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_method._: Refreshing state... [id=agm-ie44xht6ej-cvdi0juudf-OPTIONS]
module.cognito.aws_cognito_user_in_group.admin_in_admin_group: Refreshing state... [id=terraform-20241204061100990400000002]
module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getInfo]
module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getConfiguration]
module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getEntryTypes]
module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-performQuery]
module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getFilteringTerms]
module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-deidentifyFiles]
module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-indexer]
module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getMap]
module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-generateCohortVCfs]
module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getProjects]
module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-updateFiles]
module.sbeacon.aws_api_gateway_integration.root-get: Refreshing state... [id=agi-ie44xht6ej-cvdi0juudf-GET]
module.sbeacon.aws_api_gateway_integration.info: Refreshing state... [id=agi-ie44xht6ej-571p64-GET]
module.sbeacon.aws_lambda_permission.APIGetInfo: Refreshing state... [id=AllowAPIGetInfoInvoke]
module.sbeacon.aws_lambda_permission.APIGetinfo-root: Refreshing state... [id=AllowAPIGetinfoRootInvoke]
module.sbeacon.aws_api_gateway_integration.entry_types: Refreshing state... [id=agi-ie44xht6ej-f56oez-GET]
module.sbeacon.aws_api_gateway_integration.configuration: Refreshing state... [id=agi-ie44xht6ej-rr4wq8-GET]
module.sbeacon.aws_lambda_permission.APIGetConfiguration: Refreshing state... [id=AllowAPIGetConfigurationInvoke]
module.sbeacon.aws_lambda_permission.APIGetEntryTypes: Refreshing state... [id=AllowAPIGetEntryTypesInvoke]
module.sbeacon.aws_lambda_permission.SNSperformQuery: Refreshing state... [id=SBeaconBackendAllowSNSperformQueryInvoke]
module.sbeacon.aws_sns_topic_subscription.performQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:307946671795:performQuery:5fed4b87-8791-4d23-b83d-de2bce7f639e]
module.sbeacon.aws_lambda_permission.APIGetFilteringTerms: Refreshing state... [id=AllowAPIGetFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.filtering_terms: Refreshing state... [id=agi-ie44xht6ej-fxz20h-GET]
module.sbeacon.module.lambda-admin.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-admin]
module.sbeacon.aws_lambda_permission.S3deidentifyFiles: Refreshing state... [id=SBeaconBackendAllowS3deidentifyFilesInvoke]
module.sbeacon.aws_lambda_permission.APIGetmap: Refreshing state... [id=AllowAPIGetMapInvoke]
module.sbeacon.aws_api_gateway_integration.map: Refreshing state... [id=agi-ie44xht6ej-d6vqj2-GET]
module.sbeacon.aws_api_gateway_integration_response.root-get: Refreshing state... [id=agir-ie44xht6ej-cvdi0juudf-GET-200]
module.sbeacon.aws_api_gateway_integration_response.info: Refreshing state... [id=agir-ie44xht6ej-571p64-GET-200]
module.sbeacon.aws_api_gateway_integration_response.entry_types: Refreshing state... [id=agir-ie44xht6ej-f56oez-GET-200]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-ie44xht6ej-fxz20h-GET-200]
module.sbeacon.aws_api_gateway_integration.projects: Refreshing state... [id=agi-ie44xht6ej-2a05a6-GET]
module.sbeacon.aws_lambda_permission.APIGetProjects: Refreshing state... [id=AllowAPIGetProjectsInvoke]
module.sbeacon.aws_lambda_permission.S3updateFiles: Refreshing state... [id=SBeaconBackendAllowS3updateFilesInvoke]
module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0]: Refreshing state... [id=sbeacon-backend-splitQuery:sbeacon-backend-splitQuery]
module.sbeacon.aws_api_gateway_integration_response.projects: Refreshing state... [id=agir-ie44xht6ej-2a05a6-GET-200]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0]
module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1]
module.sbeacon.aws_lambda_permission.APIadmin_proxy: Refreshing state... [id=AllowAPIadmin_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.admin_proxy: Refreshing state... [id=agi-ie44xht6ej-uol7gv-ANY]
module.sbeacon.aws_s3_bucket_notification.updateFiles: Refreshing state... [id=gaspi-dataportal-20250110044710445000000002]
module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-splitQuery]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration._: Refreshing state... [id=agi-ie44xht6ej-cvdi0juudf-OPTIONS]
module.sbeacon.module.cors-info-root.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ie44xht6ej-cvdi0juudf-OPTIONS-200]
module.sbeacon.aws_sns_topic_subscription.splitQuery: Refreshing state... [id=arn:aws:sns:ap-southeast-3:307946671795:splitQuery:d16ad8f2-95a3-49ec-853d-a89d4f645be0]
module.sbeacon.aws_lambda_permission.SNSsplitQuery: Refreshing state... [id=SBeaconBackendAllowSNSsplitQueryInvoke]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-2]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-3]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-0]
module.sbeacon.module.lambda-getRuns.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getRuns:sbeacon-backend-getRuns-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-1]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-0]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-2]
module.sbeacon.module.lambda-getIndividuals.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getIndividuals:sbeacon-backend-getIndividuals-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-3]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-0]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-1]
module.sbeacon.module.lambda-getBiosamples.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getBiosamples:sbeacon-backend-getBiosamples-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-1]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-3]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-2]
module.sbeacon.module.lambda-getDatasets.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getDatasets:sbeacon-backend-getDatasets-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.aws_api_gateway_integration_response.map: Refreshing state... [id=agir-ie44xht6ej-d6vqj2-GET-200]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.aws_api_gateway_integration_response.admin_proxy: Refreshing state... [id=agir-ie44xht6ej-uol7gv-ANY-200]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-ie44xht6ej-w9v6rx-GET]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-ie44xht6ej-ejinz3-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-ie44xht6ej-ctcjbz-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-ie44xht6ej-w9v6rx-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-ie44xht6ej-r7891j-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-ie44xht6ej-ejinz3-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-ie44xht6ej-r7891j-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-ie44xht6ej-ctcjbz-POST]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-ie44xht6ej-w9v6rx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-ie44xht6ej-ejinz3-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-ie44xht6ej-w9v6rx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-ie44xht6ej-r7891j-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-ie44xht6ej-ejinz3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-ie44xht6ej-r7891j-POST-200]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-ie44xht6ej-644tan-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-ie44xht6ej-mth0ua-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-ie44xht6ej-kd288s-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-ie44xht6ej-jbisxi-GET]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-ie44xht6ej-644tan-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-ie44xht6ej-qoymxe-GET]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-ie44xht6ej-qoymxe-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-ie44xht6ej-jbisxi-POST]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-ie44xht6ej-mth0ua-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-ie44xht6ej-kd288s-POST]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-ie44xht6ej-ctcjbz-POST-200]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-ie44xht6ej-vud1nd-POST]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-ie44xht6ej-xp4kaq-GET]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-ie44xht6ej-8vgzor-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-ie44xht6ej-oyrzyr-GET]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-ie44xht6ej-8vgzor-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-ie44xht6ej-6or2bd-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-ie44xht6ej-vud1nd-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-ie44xht6ej-6or2bd-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-ie44xht6ej-xp4kaq-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-ie44xht6ej-oyrzyr-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-ie44xht6ej-2390s8-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-ie44xht6ej-zugz2o-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-ie44xht6ej-zugz2o-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-ie44xht6ej-2390s8-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-ie44xht6ej-3oibyp-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-ie44xht6ej-7u2paa-GET]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-ie44xht6ej-kmbmk2-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-ie44xht6ej-v43f7d-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-ie44xht6ej-7u2paa-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-ie44xht6ej-3oibyp-GET]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-ie44xht6ej-kmbmk2-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-ie44xht6ej-v43f7d-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-ie44xht6ej-opnk88-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-ie44xht6ej-mp4ybi-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-ie44xht6ej-bvsqdc-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-ie44xht6ej-opnk88-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-ie44xht6ej-su0dln-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-ie44xht6ej-su0dln-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-ie44xht6ej-f9bnos-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-ie44xht6ej-f9bnos-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-ie44xht6ej-mp4ybi-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-ie44xht6ej-0od49b-POST]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-ie44xht6ej-0uetuv-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-ie44xht6ej-0uetuv-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-ie44xht6ej-bvsqdc-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-ie44xht6ej-0od49b-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-ie44xht6ej-l4ys82-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-ie44xht6ej-l4ys82-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-ie44xht6ej-omr0r2-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-ie44xht6ej-8aa2iw-POST]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-ie44xht6ej-u3j0s3-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-ie44xht6ej-omr0r2-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-ie44xht6ej-8aa2iw-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-ie44xht6ej-u3j0s3-GET]
module.sbeacon.aws_api_gateway_integration_response.configuration: Refreshing state... [id=agir-ie44xht6ej-rr4wq8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-ie44xht6ej-mth0ua-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-ie44xht6ej-kd288s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-ie44xht6ej-jbisxi-GET-200]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ie44xht6ej-cvdi0juudf-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-ie44xht6ej-qoymxe-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-ie44xht6ej-jbisxi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-ie44xht6ej-ctcjbz-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-ie44xht6ej-vud1nd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-ie44xht6ej-8vgzor-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-ie44xht6ej-oyrzyr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-ie44xht6ej-8vgzor-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-ie44xht6ej-6or2bd-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-ie44xht6ej-vud1nd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-ie44xht6ej-6or2bd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-ie44xht6ej-xp4kaq-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-ie44xht6ej-644tan-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-ie44xht6ej-2390s8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-ie44xht6ej-zugz2o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-ie44xht6ej-mth0ua-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-ie44xht6ej-oyrzyr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-ie44xht6ej-3oibyp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-ie44xht6ej-7u2paa-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-ie44xht6ej-zugz2o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-ie44xht6ej-v43f7d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-ie44xht6ej-2390s8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-ie44xht6ej-kd288s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-ie44xht6ej-7u2paa-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-ie44xht6ej-kmbmk2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-ie44xht6ej-bvsqdc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-ie44xht6ej-opnk88-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-ie44xht6ej-su0dln-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-ie44xht6ej-v43f7d-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-ie44xht6ej-f9bnos-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-ie44xht6ej-f9bnos-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-ie44xht6ej-opnk88-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-ie44xht6ej-0od49b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-ie44xht6ej-mp4ybi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-ie44xht6ej-0uetuv-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-ie44xht6ej-bvsqdc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-ie44xht6ej-mp4ybi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-ie44xht6ej-l4ys82-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-ie44xht6ej-l4ys82-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-ie44xht6ej-3oibyp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-ie44xht6ej-8aa2iw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-ie44xht6ej-u3j0s3-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-ie44xht6ej-0uetuv-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-ie44xht6ej-omr0r2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-ie44xht6ej-8aa2iw-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-ie44xht6ej-u3j0s3-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-ie44xht6ej-0od49b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-ie44xht6ej-omr0r2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-ie44xht6ej-qoymxe-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-ie44xht6ej-644tan-POST-200]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ie44xht6ej-2390s8-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-ie44xht6ej-kmbmk2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-ie44xht6ej-su0dln-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-ie44xht6ej-xp4kaq-GET-200]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has changed
  ~ resource "docker_image" "this" {
        id           = "sha256:0f7481e4f3877cb54303a28be1380bd0e60924626f85c7d740efe248c6bd0936307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ image_id     = "sha256:0f7481e4f3877cb54303a28be1380bd0e60924626f85c7d740efe248c6bd0936" -> "sha256:f22db1a6bb152c023487d35f0b3a6466778a6a58eada363bdbf873e536d3faae"
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:ap-southeast-3:307946671795:sesDeliveryLogger",
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "307946671795",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be updated in-place
  ~ resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
        id                               = "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9"
      ~ tags                             = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                         = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "gaspi_user_pool" {
        id                         = "ap-southeast-3_1pggQ2ofX"
        name                       = "gaspi-users"
      ~ tags                       = {
          ~ "Environment" = "STAGING" -> "dev"
            "NAME"        = "cognito-infrastructure"
          ~ "Owner"       = "GXC" -> "gaspi"
        }
      ~ tags_all                   = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (16 unchanged attributes hidden)

      ~ email_configuration {
          ~ from_email_address     = "dian.larasaty@xapiens.id" -> "no.reply.gaspi.notifications@gmail.com"
          ~ source_arn             = "arn:aws:ses:ap-southeast-3:307946671795:identity/dian.larasaty@xapiens.id" -> "arn:aws:ses:ap-southeast-3:307946671795:identity/no.reply.gaspi.notifications@gmail.com"
            # (3 unchanged attributes hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "admin_group_role_policy" {
        id               = "arn:aws:iam::307946671795:policy/gaspi-admin-group-role-policy"
        name             = "gaspi-admin-group-role-policy"
      ~ tags             = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "manager_group_role_policy" {
        id               = "arn:aws:iam::307946671795:policy/gaspi-manager-group-role-policy"
        name             = "gaspi-manager-group-role-policy"
      ~ tags             = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.admin_group_role will be updated in-place
  ~ resource "aws_iam_role" "admin_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-admin-group-role"
        name                  = "gaspi-admin-group-role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_authenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_authenticated"
        name                  = "gaspi_authenticated"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_unauthenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "unauthenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_unauthenticated"
        name                  = "gaspi_unauthenticated"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.manager_group_role will be updated in-place
  ~ resource "aws_iam_role" "manager_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ff48e61-9ece-46c3-9628-284b783a62d9"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-manager-group-role"
        name                  = "gaspi-manager-group-role"
      ~ tags                  = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.bounce must be replaced
-/+ resource "aws_ses_identity_notification_topic" "bounce" {
      ~ id                       = "dian.larasaty@xapiens.id|Bounce" -> (known after apply)
      ~ identity                 = "dian.larasaty@xapiens.id" -> "no.reply.gaspi.notifications@gmail.com" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.complaint must be replaced
-/+ resource "aws_ses_identity_notification_topic" "complaint" {
      ~ id                       = "dian.larasaty@xapiens.id|Complaint" -> (known after apply)
      ~ identity                 = "dian.larasaty@xapiens.id" -> "no.reply.gaspi.notifications@gmail.com" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.delivery must be replaced
-/+ resource "aws_ses_identity_notification_topic" "delivery" {
      ~ id                       = "dian.larasaty@xapiens.id|Delivery" -> (known after apply)
      ~ identity                 = "dian.larasaty@xapiens.id" -> "no.reply.gaspi.notifications@gmail.com" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic" "sesDeliveryLogger" {
        id                                       = "arn:aws:sns:ap-southeast-3:307946671795:sesDeliveryLogger"
        name                                     = "sesDeliveryLogger"
      ~ tags                                     = {
          - "Environment" = "STAGING" -> null
          - "Owner"       = "GXC" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "STAGING" -> "dev"
          ~ "Owner"       = "GXC" -> "gaspi"
            # (1 unchanged element hidden)
        }
        # (29 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic_policy" "sesDeliveryLogger" {
        id     = "arn:aws:sns:ap-southeast-3:307946671795:sesDeliveryLogger"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "307946671795"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ses.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:307946671795:sesDeliveryLogger"
                      - Sid       = "AllowSESToPublishToSNS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-metadata-20250110044708770100000001",
              + "arn:aws:s3:::gaspi-metadata-20250110044708770100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:307946671795:table/sbeacon-dataportal-project-users/index/uid-index",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + "arn:aws:athena:ap-southeast-3:307946671795:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
   
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.